app/views/articles/_comments.html.erb

  <div class="col-md-6">
      <%= @article.omments.count %> comentarios
---
SELECT "omments".* FROM "omments" WHERE "omments"."article_id" = ?  [["article_id", 26]]
SELECT COUNT(*) FROM "omments" WHERE "omments"."article_id" = ?  [["article_id", 7]]