app/views/articles/myArticles.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---

<% current_user.articles.each do |article|%>