app/views/articles/show.html.erb

                    / en
                    <% @article.categories.each do |category|%>
---
SELECT "categories".* FROM "categories"


<% @article.omments.each do |comment|%>
---
SELECT "omments".* FROM "omments" WHERE "omments"."article_id" = ?  [["article_id", 8]]