app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
#traerse todos los elementos de articles de la base de datos y guardarlos en @articles para accederlos desde la vista

    @articles = Article.paginate(page: params[:page],per_page:9).publicado.latest

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post nuevo"], ["body", "Este es un nuevo post"], ["created_at", "2016-06-14 15:17:03.286552"], ["updated_at", "2016-06-14 15:17:03.286552"]]
INSERT INTO "has_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["article_id", 16], ["created_at", "2016-06-28 18:14:45.572722"], ["updated_at", "2016-06-28 18:14:45.572722"]]
---
def create

  @article = current_user.articles.new(article_params)
  @article.categories = params[:categories]
if  @article.save

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Primer articulo333"], ["updated_at", "2016-06-14 17:49:46.200593"], ["id", 1]]
---
def update


  if @article.update(article_params)