app/controllers/categories_controller.rb

  def show
    @articles=@category.articles.paginate(page: params[:page],per_page:9)
---
SELECT "articles".* FROM "articles" INNER JOIN "has_categories" ON "articles"."id" = "has_categories"."article_id" WHERE "has_categories"."category_id" = ?  [["category_id", 1]]
SELECT COUNT(*) FROM "articles" INNER JOIN "has_categories" ON "articles"."id" = "has_categories"."article_id" WHERE "has_categories"."category_id" = ?  [["category_id", 1]]

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Diseño"], ["color", "#8080ff"], ["created_at", "2016-06-28 16:44:47.959904"], ["updated_at", "2016-06-28 16:44:47.959904"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "color" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Samsung"], ["color", "#0000a0"], ["updated_at", "2016-07-01 16:33:28.101587"], ["id", 1]]