app/controllers/omments_controller.rb

  def index
    @omments = Omment.all
---
SELECT "omments".* FROM "omments"

  def create
    @omment = current_user.omments.new(omment_params)
    @omment.article = @article
    respond_to do |format|
      if @omment.save
---
INSERT INTO "omments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "nuevo comentario del post"], ["user_id", 2], ["article_id", 1], ["created_at", "2016-06-22 18:22:22.540209"], ["updated_at", "2016-06-22 18:22:22.540209"]]

  def set_article
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

    def set_omment
      @omment = Omment.find(params[:id])
---
SELECT  "omments".* FROM "omments" WHERE "omments"."id" = ? LIMIT 1  [["id", 1]]