app/controllers/welcome_controller.rb

SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def dashboard

      @articles = Article.paginate(page: params[:page],per_page:5)